"use client";
import React from "react";

import { Tree } from "antd";
import type { TreeDataNode, TreeProps } from "antd";

const treeData: TreeDataNode[] = [
  {
    title: "তালুগদার",
    key: "1",
    children: [
      {
        title: "ইজ্জত আলী বাছার",
        key: "1-1",
        children: [
          {
            title: "হাজ্বী দাগু বাছার",
            key: "1-1-1",
            children: [
              {
                title: "ধনাই বাছার/ দিল মোহাম্মদ বাছার",
                key: "1-1-1-1",
                children: [
                  {
                    title: "মালেক বাছার",
                    key: "1-1-1-1-1",
                    children: [
                      { title: "সেলিনা", key: "1-1-1-1-1-1" },
                      { title: "নাছিমা", key: "1-1-1-1-1-2" },
                      { title: "জাকির হোসেন", key: "1-1-1-1-1-3" },
                      { title: "আলী হোসেন", key: "1-1-1-1-1-4" },
                      { title: "হানীফ", key: "1-1-1-1-1-5" },
                      { title: "ওমর ফারুক", key: "1-1-1-1-1-6" },
                    ],
                  },
                  { title: "হালেম বাছার", key: "1-1-1-1-2" },
                  { title: "সালেহা", key: "1-1-1-1-3" },
                ],
              },
              {
                title: "নান্দু বাছার",
                key: "1-1-1-2",
                children: [
                  {
                    title: "আদলউদ্দিন বাছার",
                    key: "1-1-1-2-1",
                    children: [
                      {
                        title: "ছাদেক বাছার",
                        key: "1-1-1-2-1-1",
                        children: [
                          {
                            title: "শহিদুল বাছার",
                            key: "1-1-1-2-1-1-1",
                            children: [
                              { title: "আরাফাত", key: "1-1-1-2-1-1-1-1" },
                            ],
                          },
                          { title: "জানু বেগম", key: "1-1-1-2-1-1-2" },
                          { title: "শিউলি আক্তার", key: "1-1-1-2-1-1-3" },
                        ],
                      },
                      {
                        title: "কাদির বাছার",
                        key: "1-1-1-2-1-2",
                        children: [
                          { title: "রফিকুল", key: "1-1-1-2-1-2-1" },
                          { title: "সাইমন", key: "1-1-1-2-1-2-2" },
                          {
                            title: "রোজিনা",
                            key: "1-1-1-2-1-2-3",
                            children: [
                              { title: "মাহমুদ", key: "1-1-1-2-1-2-3-1" },
                              { title: "রিয়া মনি", key: "1-1-1-2-1-2-3-2" },
                              { title: "রাতুল", key: "1-1-1-2-1-2-3-3" },
                            ],
                          },
                          { title: "ফিরোজা", key: "1-1-1-2-1-2-4" },
                        ],
                      },
                      {
                        title: "খিদির বাছার",
                        key: "1-1-1-2-1-3",
                        children: [
                          {
                            title: "লিটন",
                            key: "1-1-1-2-1-3-1",
                            children: [
                              { title: "মিহা জিনাত", key: "1-1-1-2-1-3-1-1" },
                              { title: "মায়ান রাজ", key: "1-1-1-2-1-3-1-2" },
                            ],
                          },
                          {
                            title: "আল-আমিন",
                            key: "1-1-1-2-1-3-2",
                            children: [
                              { title: "সাদমান সাইফ", key: "1-1-1-2-1-3-2-1" },
                            ],
                          },
                          { title: "আবুল", key: "1-1-1-2-1-3-3" },
                          { title: "মামুন", key: "1-1-1-2-1-3-4" },
                          { title: "হযরত", key: "1-1-1-2-1-3-5" },
                        ],
                      },
                      {
                        title: "তোতা বাছার",
                        key: "1-1-1-2-1-4",
                        children: [
                          { title: "রকি", key: "1-1-1-2-1-4-1" },
                          { title: "রত্না", key: "1-1-1-2-1-4-2" },
                          { title: "মুন্নি", key: "1-1-1-2-1-4-3" },
                        ],
                      },
                      {
                        title: "আতা বাছার",
                        key: "1-1-1-2-1-5",
                        children: [
                          { title: "অমিত", key: "1-1-1-2-1-5-1" },
                          { title: "অনিক", key: "1-1-1-2-1-5-2" },
                        ],
                      },
                      {
                        title: "রাবিয়া",
                        key: "1-1-1-2-1-6",
                        children: [
                          { title: "দেলোয়ার শেখ", key: "1-1-1-2-1-6-1" },
                          { title: "ইসমাইল", key: "1-1-1-2-1-6-2" },
                        ],
                      },
                      {
                        title: "সুফিয়া",
                        key: "1-1-1-2-1-7",
                        children: [
                          { title: "ফারুক", key: "1-1-1-2-1-7-1" },
                          { title: "সুলতান(মেষার)", key: "1-1-1-2-1-7-2" },
                          { title: "দানেছ", key: "1-1-1-2-1-7-3" },
                          { title: "নজির", key: "1-1-1-2-1-7-4" },
                        ],
                      },
                      {
                        title: "সোনাই",
                        key: "1-1-1-2-1-8",
                        children: [
                          { title: "দুলাল", key: "1-1-1-2-1-8-1" },
                        ],
                      },
                    ],
                  },
                  {
                    title: "দলিল উদ্দিন বাছার",
                    key: "1-1-1-2-2",
                    children: [
                      {
                        title: "সেকান্দার বাছার",
                        key: "1-1-1-2-2-1",
                        children: [
                          { title: "সোহেল রানা", key: "1-1-1-2-2-1-1" },
                          { title: "সুবর্না", key: "1-1-1-2-2-1-2" },
                          { title: "সাথী", key: "1-1-1-2-2-1-3" },
                        ],
                      },
                      {
                        title: "ইস্কান্দার বাছার",
                        key: "1-1-1-2-2-2",
                        children: [
                          { title: "শাহিন আলম", key: "1-1-1-2-2-2-1" },
                          { title: "শারমিন", key: "1-1-1-2-2-2-2" },
                          { title: "ইভানা", key: "1-1-1-2-2-2-3" },
                          { title: "তানিয়া", key: "1-1-1-2-2-2-4" },
                        ],
                      },
                      {
                        title: "রাজ্জাক বাছার",
                        key: "1-1-1-2-2-3",
                        children: [
                          { title: "সাগর", key: "1-1-1-2-2-3-1" },
                          { title: "তানভীর", key: "1-1-1-2-2-3-2" },
                          { title: "রূপা", key: "1-1-1-2-2-3-3" },
                          { title: "সুমাইয়া", key: "1-1-1-2-2-3-4" },
                        ],
                      },
                      {
                        title: "দাদন বাছার",
                        key: "1-1-1-2-2-4",
                        children: [
                          { title: "ইমরান", key: "1-1-1-2-2-4-1" },
                          { title: "রাকিব", key: "1-1-1-2-2-4-2" },
                          { title: "রুবি", key: "1-1-1-2-2-4-3" },
                        ],
                      },
                      {
                        title: "ফারুক বাছার",
                        key: "1-1-1-2-2-5",
                        children: [
                          { title: "রাসেল", key: "1-1-1-2-2-5-1" },
                          { title: "রিফাত", key: "1-1-1-2-2-5-2" },
                          { title: "নুসরাত", key: "1-1-1-2-2-5-3" },
                        ],
                      },
                      {
                        title: "শাহ জামাল বাছার",
                        key: "1-1-1-2-2-6",
                        children: [
                          { title: "সাদিয়া অরিন আশা", key: "1-1-1-2-2-6-1" },
                          { title: "সামিহা", key: "1-1-1-2-2-6-2" },
                          { title: "আরিশা", key: "1-1-1-2-2-6-3" },
                        ],
                      },
                    ],
                  },
                  {
                    title: "বরু",
                    key: "1-1-1-2-3",
                    children: [
                      { title: "মজিদ মোল্লা", key: "1-1-1-2-3-1" },
                      { title: "আনোয়ারা - ইমানের(ভ্যান চালক) বউ", key: "1-1-1-2-3-2" },
                      { title: "মনোয়ারা(মাওয়া স্বামী-ইনূস মৃধা)", key: "1-1-1-2-3-3" },
                      { title: "সূর্য (রিয়া মনিদের বাড়ির সামনে)", key: "1-1-1-2-3-4" },
                      { title: "ফরিদা(স্বামী-ছমুরুদ্দিন)", key: "1-1-1-2-3-5" },
                    ],
                  },
                  {
                    title: "সবুরা",
                    key: "1-1-1-2-4",
                    children: [
                      { title: "পিয়ারি (১ম ঘরে)", key: "1-1-1-2-4-1" },
                      {
                        title: "আলাউদ্দিন হাওলাদার",
                        key: "1-1-1-2-4-2",
                        children: [
                          { title: "জসিম", key: "1-1-1-2-4-2-1" },
                          { title: "বিপ্লব", key: "1-1-1-2-4-2-2" },
                          { title: "মোহাসিন", key: "1-1-1-2-4-2-3" },
                          { title: "সোহাগ", key: "1-1-1-2-4-2-4" },
                          { title: "ঐশি", key: "1-1-1-2-4-2-5" },
                          { title: "সাইমা", key: "1-1-1-2-4-2-6" },
                        ],
                      },
                      {
                        title: "খলিল হাওলাদার",
                        key: "1-1-1-2-4-3",
                        children: [
                          { title: "জুয়েল", key: "1-1-1-2-4-3-1" },
                          { title: "রাবি", key: "1-1-1-2-4-3-2" },
                          { title: "কলি", key: "1-1-1-2-4-3-3" },
                        ],
                      },
                    ],
                  },
                ],
              },
              {
                title: "ইয়াসিন বাছার",
                key: "1-1-1-3",
                children: [
                  { title: "আছিয়া(১ম স্ত্রীর ঘরে)", key: "1-1-1-3-1" },
                  { title: "সমর্ত্য", key: "1-1-1-3-2" },
                  { title: "ছানা", key: "1-1-1-3-3" },
                  {
                    title: "হেলেনা (ফুফু)",
                    key: "1-1-1-3-4",
                    children: [
                      { title: "সোহেল", key: "1-1-1-3-4-1" },
                      { title: "জুয়েল", key: "1-1-1-3-4-2" },
                      { title: "যুথী", key: "1-1-1-3-4-3" },
                    ],
                  },
                ],
              },
              {
                title: "ইব্রাহীম বাছার",
                key: "1-1-1-4",
                children: [
                  {
                    title: "নূরুল ইসলাম বাছার",
                    key: "1-1-1-4-1",
                    children: [
                      {
                        title: "মাসুদ",
                        key: "1-1-1-4-1-1",
                        children: [
                          { title: "শান্ত", key: "1-1-1-4-1-1-1" },
                        ],
                      },
                      {
                        title: "মফিজুল ইসলাম",
                        key: "1-1-1-4-1-2",
                        children: [
                          { title: "নীরব", key: "1-1-1-4-1-2-1" },
                          { title: "মিথীলা", key: "1-1-1-4-1-2-2" },
                        ],
                      },
                      {
                        title: "উজ্জল বাছার",
                        key: "1-1-1-4-1-3",
                        children: [
                          { title: "জুনায়েদ", key: "1-1-1-4-1-3-1" },
                          { title: "জুবায়ের", key: "1-1-1-4-1-3-2" },
                          { title: "লামিয়া", key: "1-1-1-4-1-3-3" },
                        ],
                      },
                      {
                        title: "আজিজুল ইসলাম",
                        key: "1-1-1-4-1-4",
                        children: [
                          { title: "রিহান", key: "1-1-1-4-1-4-1" },
                        ],
                      },
                      { title: "মমতাজ", key: "1-1-1-4-1-5" },
                      { title: "জীবনী", key: "1-1-1-4-1-6" },
                      {
                        title: "আঁখি",
                        key: "1-1-1-4-1-7",
                        children: [
                          { title: "লামিয়া", key: "1-1-1-4-1-7-1" },
                        ],
                      },
                      {
                        title: "পলাশ",
                        key: "1-1-1-4-1-8",
                        children: [
                          { title: "সৌরভ", key: "1-1-1-4-1-8-1" },
                          { title: "সৌরভি", key: "1-1-1-4-1-8-2" },
                          { title: "সৈকত", key: "1-1-1-4-1-8-3" },
                        ],
                      },
                      { title: "বিল্লাশ", key: "1-1-1-4-1-9" },
                      { title: "শাকিল", key: "1-1-1-4-1-10" },
                      {
                        title: "পলি",
                        key: "1-1-1-4-1-11",
                        children: [
                          { title: "শেহরিস", key: "1-1-1-4-1-11-1" },
                        ],
                      },
                    ],
                  },
                  {
                    title: "সামদ বাছার",
                    key: "1-1-1-4-2",
                    children: [
                      {
                        title: "রাজীব বাছার",
                        key: "1-1-1-4-2-1",
                        children: [
                          { title: "আব্দুল্লাহ রাহাত", key: "1-1-1-4-2-1-1" },
                          { title: "আবুসাইদ", key: "1-1-1-4-2-1-2" },
                          { title: "মিম", key: "1-1-1-4-2-1-3" },
                        ],
                      },
                      {
                        title: "সজীব বাছার",
                        key: "1-1-1-4-2-2",
                        children: [
                          { title: "সোলাইমান", key: "1-1-1-4-2-2-1" },
                          { title: "সায়মা", key: "1-1-1-4-2-2-2" },
                        ],
                      },
                      {
                        title: "আরিফ হাসান",
                        key: "1-1-1-4-2-3",
                        children: [
                          { title: "আরিয়ান তানজিল", key: "1-1-1-4-2-3-1" },
                        ],
                      },
                      {
                        title: "সাবিনা",
                        key: "1-1-1-4-2-4",
                        children: [
                          { title: "শাহাদাৎ", key: "1-1-1-4-2-4-1" },
                          { title: "সাব্বির", key: "1-1-1-4-2-4-2" },
                          { title: "লামিয়া", key: "1-1-1-4-2-4-3" },
                        ],
                      },
                      {
                        title: "ঝর্না",
                        key: "1-1-1-4-2-5",
                        children: [
                          { title: "ইউসুফ", key: "1-1-1-4-2-5-1" },
                          { title: "বিল্লাল", key: "1-1-1-4-2-5-2" },
                        ],
                      },
                    ],
                  },
                  {
                    title: "হামিদ বাছার",
                    key: "1-1-1-4-3",
                    children: [
                      {
                        title: "আসিফ",
                        key: "1-1-1-4-3-1",
                        children: [
                          { title: "সাজিদ", key: "1-1-1-4-3-1-1" },
                        ],
                      },
                      {
                        title: "আসাদুজ্জামান",
                        key: "1-1-1-4-3-2",
                        children: [
                          { title: "জাকারিয়া", key: "1-1-1-4-3-2-1" },
                        ],
                      },
                      {
                        title: "তানজিলা",
                        key: "1-1-1-4-3-3",
                        children: [
                          { title: "তামিম", key: "1-1-1-4-3-3-1" },
                        ],
                      },
                    ],
                  },
                  {
                    title: "আমজাদ বাছার",
                    key: "1-1-1-4-4",
                    children: [
                      {
                        title: "মুন",
                        key: "1-1-1-4-4-1",
                        children: [
                          { title: "নাজিফা", key: "1-1-1-4-4-1-1" },
                          { title: "নাফিসা", key: "1-1-1-4-4-1-2" },
                        ],
                      },
                      { title: "আহসান উল্লাহ", key: "1-1-1-4-4-2" },
                    ],
                  },
                  {
                    title: "সালেহা বেগম",
                    key: "1-1-1-4-5",
                    children: [
                      { title: "রুবেল", key: "1-1-1-4-5-1" },
                      { title: "রেসোনা", key: "1-1-1-4-5-2" },
                      { title: "জোৎস্না", key: "1-1-1-4-5-3" },
                    ],
                  },
                  {
                    title: "আলমাস বেগম",
                    key: "1-1-1-4-6",
                    children: [
                      {
                        title: "আল-আমিন",
                        key: "1-1-1-4-6-1",
                        children: [
                          { title: "শহিদুল", key: "1-1-1-4-6-1-1" },
                          { title: "আমিনা", key: "1-1-1-4-6-1-2" },
                        ],
                      },
                      { title: "মিজান", key: "1-1-1-4-6-2" },
                      { title: "মামুন", key: "1-1-1-4-6-3" },
                      { title: "ইমন", key: "1-1-1-4-6-4" },
                    ],
                  },
                ],
              },
            ],
          },
        ],
      },
      {
        title: "কানাই বাছার",
        key: "1-2",
        children: [
          { title: "ছন্দু বাছার", key: "1-2-1" },
          { title: "ছানাই বাছার", key: "1-2-2" },
        ],
      },
    ],
  },
];

const FamilyTree: React.FC = () => {
  const onSelect: TreeProps["onSelect"] = (selectedKeys, info) => {
    console.log("selected", selectedKeys, info);
  };

  return (
    <Tree
      showLine
      defaultExpandedKeys={["1", "1-1", "1-2", "1-1-1"]}
      onSelect={onSelect}
      treeData={treeData}
    />
  );
};

export default FamilyTree;
